package ua.pp.darknsoft;

/**
 * Created by Andrew on 23.01.2018.
 */
public enum TypeRoom {
  BDRM1,//апартаменты с одной спальней
  BDRM2,//апартаменты с двумя спальнями
  Apartment,//тип номеров в гостиницах, приближенных к виду современных квартир
  BalconyRoom,//номер с балконом
  BG, //бунгало
  Cabana,  //род бунгало на пляже (или возле бассейна), стоящего отдельно от основного здания
  DeLuxe,  //номера повышенной комфортности
  Duplex,  //двухэтажный номер
  Executive, //floor один или несколько этажей в отеле с более высоким уровнем обслуживания
  Family, //Room семейный номер размером больше стандартного
  HoneymoonRoom,// номер для молодожёнов
  HV, //(Holiday Village) отель, представляющий собой комплекс бунгало
  KingsizeBed,  //«королевская кровать» (шириной более 180 см)
  KingSuite,  //«королевский сьют»
  MB, // (main building) основное здание
  NewBuilding,  //новый корпус
  SittingArea,  //зона для отдыха – часть номера, где располагаются кресла, журнальный столик, иногда также диван
  Standart,  //стандартная комната
  Studio,  //однокомнатный номер больше стандартного, с небольшой низкой перегородкой;
  Suite,  //номер повышенной комфортности, как правило – одна комната большой площади, с зоной для отдыха
  SuiteExecutive,  //как правило, «сьют» с двумя спальнями
  SuiteJunior,  //номер повышенной комфортности: обычно большая комфортабельная комната с отгороженным спальным местом
  SuiteMini,  //номер улучшенной категории (лучше, чем Superior)
  SuiteSenior,  //номер повышенной комфортности, как правило, двухкомнатный: гостиная и спальня
  Superior, //комната большего размера, чем стандартная
  SuperiorChalet, //шале повышенной комфортности
  Superior_MainBuilding, //комната большего размера в главном здании
  ConnectedRooms; //совмещённые номера, имеющие дверь-проход из одного в другой
}
